package service;

class student{
	String ban;
	String name;
	String gender;
	int[] score;
	int sum;
	int avg;
	int rank;
}

public class methodTest {

	public static void main(String[] args) {
		//  학생클래스를 정의, 선언, 생성, 호출 하여 학생정보를 출력하세요
		//  반, 이름, 성별,  점수 [국어, 영어, 수학], 총점, 평균, 등수

		//  출력 방식
		//  0. 입력순서 1. 전체등수  2. 반별 등수
		//  각 카테고리별 누계 출력할 것
		//  누계 : 합계, 최고, 최소
		//  1. 반별로 구분하여 출력할것
		//  2. 반별로 등수 순서대로 출력할것
		/* 반, 이름, 국어, 영어, 수학
		 1,"현빈",77,79,71
		 3,"원빈",67,96,61
		 5,"박현빈",97,89,91
		 4,"김우빈",57,15,51
		 4,"장희빈",87,49,81
		 2,"커피빈",77,39,51
		 4,"골빈",87,96,91
		 3,"캐빈",97,99,91
		 2,"젤리빈",44,65,51
		 8,"빈익빈",77,89,51
		 * */
		
		
		
	}

}
